{
    "projects": [
        {
            "id": "01",
            "name": "Common Plant Data Platform and User Interface",
            "role": "Project Delivery Executive",
            "year": "2021",
            "outcome": "Lead the design for a new plant data platform to improve productivity and OEE",
            "summary": "Designed and Lead the blueprint for a new common plant data platform across five plants globally, as well as a new common user interface to improve productivity",
            "description": "Designed and Lead the blueprint for a new common plant data platform across five plants globally, as well as a new common user interface to improve productivity.  The approach ran across two tracks:  An Architecture track which defined an event-driven architecture to capture and normalize data into a common information model, as well as a User Interface track which took and end-user approach to improve customer experience and iprove productivity with a streamlined application.  This set the foundation for a multi-year initiative to not only build a new common experience for their key manufacturing stakeholders, but also to set an important platform in which the benefits of data and AI can be realized under the umbrella of 'Smart Manufacturing' or 'Industry 4.0'",
            "industries": ["Semiconductor", "Manufacturing"],
            "skills": ["Cloud", "OpenShift", "Kubernetes", "Event Driven Architecture", "Enterprise Integration"],
            "products": ["IBM Cloud"],
            "url": "http://www.google.com",
            "urldescription": "A search engine",
            "image": "/projects/industry4.0.jpg"
          },
    {
      "id": "1",
      "name": "Industrial Connected Assets",
      "role": "Project Delivery Executive",
      "year": "2019",
      "outcome": "Optimizing Operations with Enhanced Visibility through IoT",
      "summary": "Designed and Lead an End-To-End Solution using IoT to drive transformation in Maintenance and Supply Chain",
      "description": "For a midstream equipment provider in the Oil and Gas industry, defined the technical architecture and strategy to support their digital transformation to drive improvements in customer service, field service, and supply chain.  Lead the architecture for the cloud based integration layer which integrated IoT devices from equipment deployed globally, an SAP instance hosted on a private cloud, and exposed API’s through a microservices architecture to a customer portal.  Lead the RFI and proof-of-concept for an edge device to integrate with client equipment and communicate data securely over cellular and satellite networks.",
      "industries": ["Oil and Gas"],
      "skills": ["Cloud", "Node.JS", "Kubernetes", "Internet of Things", "API Management", "Enterprise Integration"],
      "products": ["IBM Cloud", "Watson IoT Platform", "IBM API Connect", "IBM App Connect Integration Broker"],
      "url": "http://www.google.com",
      "urldescription": "A search engine",
      "image": "/projects/pipeline.jpg"
    },
    {
        "id": "2",
        "name": "Cognitive Traffic Monitoring",
        "role": "Project Delivery Executive and Architect",
        "year": "2018",
        "outcome": "Visibility into Traffic through IoT",
        "summary": "Designed and Lead an End-To-End Solution to monitor traffic on a busy industrial construction site",
        "description": "For a downstream chemical company in the Oil and Gas industry, provided a cloud based solution to monitor the flow of traffic on a busy construction site.  The solution used a combination of GPS tracking devices for shuttle buses, cameras with visual recognition to detect traffic congestion, and smart cones to help automate road closures.  The solution integrated to the client’s enterprise portal and also offered the ability for construction workers to ask questions through their “push-to-talk” device to receive information on current traffic conditions.",
        "industries": ["Oil and Gas"],
        "skills": ["Cloud", "Node.JS", "Internet of Things", "API Management", "Enterprise Integration", "Machine Learning", "Computer Vision"],
        "products": ["IBM Cloud", "Watson IoT Platform", "Watson Visual Recognition", "Watson Assistant"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/construction.jpg"
      },
      {
        "id": "3",
        "name": "Offshore Drilling Performance Monitoring",
        "role": "Chief Architect",
        "year": "2017",
        "outcome": "Measuring and Improving the Drilling Process with AI and IoT",
        "summary": "Designed and Lead an End-To-End Solution to Monitor Drilling Performance on Offshore Oil Rigs",
        "description": "For an offshore drilling provider in the Oil and Gas industry, provided a hybrid cloud based solution to monitor the drilling performance of 14 drilling rigs.  The solution uses IoT and Edge computing to collect data in real-time using a variety of protocols on the rig (OPC, WitsML) and send the data in real-time to a cloud environment to identify “operational events” such as running riser, pulling riser, and casing.  The technology in the cloud environment used predictive analytics to identify the operational events from a combination of sensor data from the drilling equipment and operator logs.  The operational events were then rendered as KPI’s using an HTML 5 dashboard and business analytics for “slice and dice” and “drill-down”.  While providing the architecture and overall staffing model for the solution, I also provided day-to-day guidance for the development team as well as hands-on development the IoT edge components running on the rigs.",
        "industries": ["Oil and Gas"],
        "skills": ["Cloud", "Edge", "Internet of Things", "OT Integration", "Machine Learning", "Enterprise Integration"],
        "products": ["IBM Cloud", "Watson IoT Platform", "OPCUA", "Time Series Database", "IBM MQ and Integration Broker", "SPSS"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/drilling.jpg"
      },
      {
        "id": "4",
        "name": "End To End IoT Mobile Demo",
        "role": "Presales Architect",
        "year": "2016",
        "outcome": "Demonstrate IoT with IBM Watson",
        "summary": "Designed an End-To-End IoT Demo with a Mobile Interface enabled by Watson",
        "description": "In an effort to learn the IBM Watson IoT and Cloud stack in great depth, I built an “end-to-end” demo to understand what it takes to pull together a solution.  The demo used a Raspberry PI running python with a motion sensor and a camera, which communicates with Watson IoT with MQTT  to detect movement and take pictures on-demand.  The demo also used “Node Red” on the back-end to post-process the data in various ways, such as runnign Visual Recongition on the camera images to detect the presence of a human being in the office.  The demo also used a custom iOS mobile application to provide a conversation interface using IBM’s Watson to have a conversation, allowing simple questions sich as “Is there anyone in my office”, or “When was the last time someone was in my office”, or a command such as “Take a snapshot in my office”.  The iOS mobile application was written in Apple’s Swift programming language, used REST / JSON based services from the back-end cloud environment, and also took advantage of push notifications to be notified when there was movement in my office and I was not present.",
        "industries": ["Electronics", "Consumer Products"],
        "skills": ["Cloud", "Internet of Things", "Speech Services", "Chat Bot", "iOS Mobile Development", "Node Red", "Python", "Computer Vision"],
        "products": ["IBM Cloud", "Watson IoT Platform", "Watson Services", "iOS iPhone Development", "Raspberry PI", "Node Red", "Watson Visual Recognition"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/mobile.jpg"
      },
      {
        "id": "5",
        "name": "Getting Started with Plat.One",
        "role": "Technical Enablement",
        "year": "2016",
        "outcome": "Teach developers the fundamentals of the Plat.One IoT Platform",
        "summary": "Created an Easy to Consume set of Learning Videos for the Platform",
        "description": "As a means to more scalably on-board developers into the PLAT.ONE IoT platform, I created a video series of 5 videos to help developers learn the essentials of building solutions on PLAT.ONE.  In addition ot the videos, there were 10 key samples illustrating how to build Java based services that could run both on the edge and the cloud.  The approach for the videos was to explain key concepts, and then back that up with steps and overview of the samples.  PLAT.ONE was acquired by SAP in 2016 and the videos were leveraged by SAP to help understand the capabilities of the platorm and integrate into SAP’s Leonard Stack.",
        "industries": ["Electronics", "Consumer Products"],
        "skills": ["Docker", "Java", "Edge"],
        "products": ["Docker", "Plat.One IoT Platform", "OSGI", "Eclipse"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/gettingstartedplatone.jpg"
      },
      {
        "id": "6",
        "name": "Indoor Location Analytics",
        "role": "Chief Architect",
        "year": "2015",
        "outcome": "Tracking the flow of people to understand traffic patterns",
        "summary": "Lead the development of a solution accelerator for analytics using WiFi Triangulation",
        "description": "Acting as chief architect and managing a team of 6 developers and coordinating with 2 vendors, I lead the deployment and successfully met all functional requirements while monitoring live, high volume traffic in 2 locations.  The solution leveraged a combination of iBeacons and WiFi based triangulation to derive analytics in hotel property locations to understand foot traffic and provide real-time engagement based on the location of the guest in the hotel.",
        "industries": ["Hospitality"],
        "skills": ["Streaming Analytics", "Java", "Edge"],
        "products": ["Apama", "Terracotta Cache", "Cisco Location Analytics"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/hotel.jpg"
      },
      {
        "id": "7",
        "name": "Supply Chain Command Center",
        "role": "Chief Architect",
        "year": "2015",
        "outcome": "Respond to situations in the supply chain that will disrupt customer service",
        "summary": "Lead the development of a monitoring system for a command center to monitor break-fix and repair services",
        "description": "Lead the overall effort to design a next generation command center, which watches over the entire field service dispatch process to ensure customer satisfaction and that they are meeting SLA for their different customer sets.  This was an end-to-end delivery to replace their existing system they had built over a period of 5 years in about 6 months, using off the shelf BPM, BEP, BRMS, and BI software from Progress Software.  RPM is Progress's term for the next generation of BPM, combining business process, analytics, rules, and complex event processing into a platform to build highly responsive business applications. A key aspect of the delivery was the use of a custom methodology that I created in support of such an implementation.  This implementation also used Service Oriented (SOA) concepts to enable end-users access to enterprise systems from a common portal.  ",
        "industries": ["Electronics", "High Tech Manufacturing"],
        "skills": ["Streaming Analytics", "Business Process Management", "Business Intelligence"],
        "products": ["Apama", "Savvion BPM", "Tableau"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/computerservice.jpg"
      },
      {
        "id": "8",
        "name": "Process Visiblity",
        "role": "Workshop Facilitator and Presales Architect",
        "year": "2009",
        "outcome": "Drive a plan to derive value out of enhanced visiblity into spanning business process",
        "summary": "Lead several workshops across a variety of industries to create benefits from enhanced process visiblity and create an actionable plan for implementation",
        "description": "Using the RPM Deployment Methodology, lead several collaborative workshops with our early adopter customers to conceive the RPM solution.  Customers spanned across many industries, including pharmaceuticals, logistics, financial services, and high tech manufacturing.  The design of the workshop was to take a high level concept or vision, and translate it into 'actionable', 60-90 day deliverables to help the customer realize the value of the solution.  The technical nature of the solution included BPM ('Business Process Management') for human process work-flow, analytics for real-time visualization, BEP/CEP ('Business Event Procesing, Complex Event Processing') for real-time event correlation, and BTM  ('Business Transaction Management') for event extraction from enterprise systems such as SAP, databases, J2EE, and .NET environments.  The end solution also included a front-end portal built on industry standard java, allowing multiple users the ability to gain insight into the operational activities within their environment.",
        "industries": ["Pharmaceuticals", "Financial Services"],
        "skills": ["Streaming Analytics", "Business Process Management", "Business Intelligence"],
        "products": ["Apama", "Savvion BPM", "Tableau"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/businessprocess.jpg"
      },
      {
        "id": "9",
        "name": "Worldwide Best Practice Portal",
        "role": "Technical Enablement",
        "year": "2009",
        "outcome": "Enable access to best practices to improve repeatability and reuse for presales and services",
        "summary": "Created a World Wide Best Practices Portal for Services and Presales",
        "description": "Created a Best Practice Portal using Sharepoint 2010 to allow the World-Wide Field Organization easily find methodology and best practices in support of their engagements.  This project involved working with many stakeholders across the company to gain conensus on how information will be managed.  It also required the ability to asses the technical capabilities of the platform, and work with IT to get the necessary changes to support the rollout of the portal.",
        "industries": ["Software"],
        "skills": ["Content Management", "Streaming Analytics", "Business Process Management", "Business Intelligence"],
        "products": ["Sharepoint"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/puzzlepiece.jpg"
      },
      {
        "id": "10",
        "name": "Multi-Product Strategy",
        "role": "Technical and Go-To-Market Strategist",
        "year": "2008",
        "outcome": "Helped launch a new go-to-market and technical strategy",
        "summary": "Helped define the new vision and strategy for a multi-product go-to-market for a new software platform for Enterprise IT",
        "description": "Part of a small SWAT team to define Progress Software's RPM product offering as a product release in 100 days.  Created multiple Progress RPM Demos ('Responsive Process Management'), which leverage the capabilities of BPM 'Business Process Management', BEP 'Business Event Processing', and BTM 'Business Transaction Management'.  Created a unified demo that leveraged the best product capabilities of each platform, resulting in a real-time portal capable of providing enhanced situational awareness to business users.  Lead the development of an RPM Deployment Methdology, designed to be used from conception to deployment of a project.  THe methodology consists of a business interview component, as well as the technical design component to ensure that the solution provides business value, as well as can be deployed within the target IT environment.",
        "industries": ["Software"],
        "skills": ["Technical Strategy", "Streaming Analytics", "Business Process Management", "Business Intelligence", "Enterprise Integration"],
        "products": ["Sonic ESB", "Savvion BPM", "Apama", "Tableau", "Actional"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/vision.jpg"
      },
      {
        "id": "11",
        "name": "iPhone Applications",
        "role": "Mobile Developer",
        "year": "2008",
        "outcome": "Published Multiple iPhone Applications and Learned Mobile Development",
        "summary": "Published Multiple iPhone Applications to the App Store",
        "description": "Created a universal iOS game for the iPad and iPhone platforms called 'Scavenger Camp', which combines facebook information into a virtual world and game.  The apps were written in Objective-C and Cocos-2D, and used REST based API's to communicate with the Facebook social networking sites.  Also, published an application called Cloud Publisher which allows users to send emails and postcards using predefined templates",
        "industries": ["Gaming"],
        "skills": ["Mobile Development", "iOS iPhone Development", "Objective C"],
        "products": ["Xcode", "Apple App Store", "iPhone"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/iphonedevelopment.jpg"
      },
      {
        "id": "12",
        "name": "Streaming Analytics Business Activity Monitoring",
        "role": "Presales Architect",
        "year": "2007",
        "outcome": "Integrate Streaming Analytics with ESB to provide Business Activity Monitoring",
        "summary": "Created a wizard in Eclipse to read messages from the ESB and generate analytics for the purposes of business activity monitoring",
        "description": "After building several demos, built a set of 'BAM' wizards using Java and Eclipse to reduce the demo build time from 2 days to 2 hours, allowing time for more customization for customers.  Prototyped and lead the requirements on a new streamlined integration between Sonic ESB and the Apama CEP platform.  The solution automated the ability to transform an XML ESB message into a native event structure that could be processed by the CEP engine.  Provided requirements and input to the engineering team during the productization process.",
        "industries": ["Software"],
        "skills": ["Streaming Analytics", "Java", "Business Intelligence", "Enterprise Integration"],
        "products": ["Eclipse", "Apama", "Sonic ESB"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/businessanalytics.jpg"
      },
      {
        "id": "13",
        "name": "Streaming Analytics and CEP Demo Creation",
        "role": "Presales Architect",
        "year": "2007",
        "outcome": "Create compelling demos to build the vision and show the use case of the technology",
        "summary": "Created several demos to illustrate the power of Streaming Analytics and Complex Event Processing",
        "description": "Provided custom CEP demos for a variety of prospects across many industries to demonstrate how CEP could solve a variety of problems across many industries.  For example, A real-time marketing promotions application, to demonstrate how CEP can be used to provide real-time marketing promotions in response to location based events.  The specific use case was the ability to detect credit card swipes at client locations, and offer relevant offers by cell phone.  For example, A real-time fraud demo, which is to show how CEP can correlate many different transactions across various channels in real-time and provide not only fraud detection, but fraud prevention by responding in miiliseconds when fraud is detected.  For example, Smart Grid Demos to illustrate how CEP can have a positive impact for the smart-grid initiative - specifically around Outage Management and Demand Response Programs",
        "industries": ["Software", "Financial Services", "Utilities"],
        "skills": ["Streaming Analytics", "Java", "Business Intelligence", "Complex Event Processing"],
        "products": ["Eclipse", "Apama", "Java"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/businessdemo.jpg"
      },
      {
        "id": "14",
        "name": "Capital Markets Algorithmic Trading",
        "role": "Practice Manager",
        "year": "2006",
        "outcome": "Build high speed, automated trading algorithms for buy side and sell-side firms",
        "summary": "Lead several engagements for sell-side and buy-side firms to implement a flexible, automated high-speed algorithmic trading system with native exchange connections",
        "description": "For several sell-side and buy-side financial services firms, provided oversight for several algorithmic trading applications for equities, FX, and futures.  Promoted the use of a common framework for deployment of algorithmic trading applications.  The framework lead to the building of Apama's Algorithmic Trading Solution Accelerator, in use today at many firms.",
        "industries": ["Financial Services", "Capital Markets"],
        "skills": ["Streaming Analytics", "Java", "Complex Event Processing", "Market Data", "Capital Markets"],
        "products": ["Apama", "FIX", "Market Data"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/trading.jpg"
      },
      {
        "id": "15",
        "name": "Home Monitoring IoT Project",
        "role": "Personal Side Project",
        "year": "2006",
        "outcome": "Create a simple home monitoring solution using low cost sensors",
        "summary": "Created a simple home monitoring solution using low cost sensors, a web site, and web services",
        "description": "Built a home sensor monitoring solution targeted at the consumer with part-time residencies.  The solution is designed to report temperature, humidity, and motion to a centralized web site.  Direct hands on experience with C/C++ Win32 Programming with MS Visual C/C++ 2005, and Windows Services",
        "industries": ["Software"],
        "skills": ["Internet of Things", "C/C++", "Windows Programming", "Web Services"],
        "products": ["C/C++", "Windows DLL"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/smart-home.jpg"
      },
      {
        "id": "16",
        "name": "Enterprise Service Bus Architecture",
        "role": "SOA Architect",
        "year": "2005",
        "outcome": "Design a robust integration architecture using the Enterprise Service Bus (ESB) Approach.  Pictured at left is the book that I contributed to.",
        "summary": "Lead several engagements to create an integration architecture that spans internal business units and external partners using SOA and the Enterprise Service Bus",
        "description": "For Progress Sonic Software, provided oversight for several ESB/SOA style integration projects during the early stages of the ESB market.  Created a set of service offerings and supporting best practices to help consultants deliver repeatable engagements.  Provided initial architecture and direction for a large, international pharmaceutical company trying to define a global integration architecture across multiple, federated business units.  Provided initial architecture and direction for an ERP software company, whose goal was to offer a more open environment using an Enterprise Service Bus as the foundation of the integration architecture.",
        "industries": ["Financial Services", "Pharmaceuticals", "Manufacturing"],
        "skills": ["Enterprise Integration", "SOA", "Messaging", "Web Services"],
        "products": ["Sonic ESB", "Sonic MQ", "XML", "JSON"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/esb.jpg"
      },
      {
        "id": "17",
        "name": "Enterprise Messaging Architecture",
        "role": "Messaging Architect",
        "year": "2004",
        "outcome": "Design robust, high-volume messaging solutions for large enterprises",
        "summary": "Lead several engagements and managed a professional services team to provide consulting for several large messaging projects",
        "description": "For several fortune 500 companies, helped identify performance, security, high availability, and scalability concerns with their Sonic MQ messaging solution.  Provided support in advance of their implementation, as well as provided detailed help and trouble-shooting to diagnose and correct critical deployment issues.  For example, at the NYMEX, I provided architectural oversight and support to help integrate a highly available messaging solution into the trading infrastructure, allowing trades to be continuously and reliably moved to a back-end reporting system.",
        "industries": ["Financial Services", "Capital Markets", "Consumer Products", "Manufacturing"],
        "skills": ["Enterprise Integration", "SOA", "Messaging", "Web Services", "Capital Markets"],
        "products": ["Sonic MQ", "XML", "JSON", "JMS"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/jms.jpg"
      },
      {
        "id": "18",
        "name": "Presales Proof of Concept",
        "role": "Proof of Concept Lead",
        "year": "2004",
        "outcome": "Lead the creation of a proof of concept for the Enterprise Service Bus for a large Multi-National Supermarket Chain",
        "summary": "Lead a proof of concept for an early stage ESB adopter for a large supermarket change",
        "description": "For a large international supermarket chain, lead the design and implementation of a prototype to support a real-time integration architecture between the head-office and it’s retail stores.  The system facilitated the delivery of real-time information in both directions.  For example, the contents of each shopping basket were transmitted in real-time to the head-office, while price and inventory updates were delivered in a multi-cast fashion to multiple retail stores.  The solution used the facilities of Sonic ESB, JMS, XSLT, XPATH, Castor, XML, and Java. ",
        "industries": ["Retail"],
        "skills": ["Enterprise Integration", "SOA", "Messaging", "Web Services"],
        "products": ["Sonic MQ", "XML", "JSON", "JMS"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/esb.jpg"
      },
      {
        "id": "19",
        "name": "Messaging and Integation Projects",
        "role": "Lead Messaging Consultant",
        "year": "2002",
        "outcome": "Lead the Design and Delivery of Several Messaging Projects",
        "summary": "Lead the design and delivery of several messaging projects",
        "description": "For a large manufacturer, built a distributed messaging infrastructure to link it’s back-end SAP systems with its distributors ERP systems to implement a “Co-Managed Inventory” process.  The project incorporated technologies such as Sonic ESB, Java, JMS, XSLT, XPATH, and XML.  Lead the definition, design, and implementation of a systems management utility for Sonic’s message bus, including a generic monitoring tool and a dynamic load balancer.  These multi-threaded java-based applications used technologies such as XML, JMS, and Log4J.",
        "industries": ["Financial Services", "Manufacturing"],
        "skills": ["Enterprise Integration", "SOA", "Messaging", "Web Services"],
        "products": ["Sonic MQ", "XML", "JSON", "JMS"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/jms.jpg"
      },
      {
        "id": "20",
        "name": "Portal Development Manager",
        "role": "Portal Development Lead",
        "year": "2001",
        "outcome": "Design and Lead a Team to Build a Portal Product",
        "summary": "Designed and lead a team to build a portal product",
        "description": "Using Bowstreet’s Business Web Factory in a J2EE environment, built a portal infrastructure capable of supporting “plug and play” portlets, “on the fly” portal creation and management, and delegated administration of both portal instances and LDAP users/groups.  Lead a team of 7 people in the definition, design, and development of the solution.",
        "industries": ["Software"],
        "skills": ["Enterprise Portals", "SOA", "Content Management", "J2EE", "HTML"],
        "products": ["Bowstreet", "XML", "HTML", "LDAP"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/htmlweb.jpg"
      },
      {
        "id": "21",
        "name": "Portal Development Manager",
        "role": "Portal Architect",
        "year": "1998",
        "outcome": "Designed customer facing portals for clients during the .COM boom in the late 90's",
        "summary": "Provided architectural oversight and guidance to clients getting on-line in the late 90's",
        "description": "Provided detailed architectural recommendations for a large high-tech manufacturing company concerning their enterprise portal strategy with Bowstreet’s Business Web Factory.  Analyzed the company’s capabilities in the areas of content management, security, search, and existing web applications and provided integration recommendations.  Lead the design and implementation of a web portal for a B2B exchange.  The exchange allowed suppliers and buyers to collaborate on the initial setup for a live B2B auction.   The web portal was built using Bowstreet’s Business Web Factory, SQL Server for back-end data access, LDAP for user authentication, and JSP, HTML, and Java Script for the presentation layer.",
        "industries": ["Financial Services", "Insurance", "High Tech Manufacturing", "Electronics", "Software"],
        "skills": ["Enterprise Portals", "SOA", "Content Management", "J2EE", "HTML"],
        "products": ["Bowstreet", "XML", "HTML", "LDAP"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/htmlweb.jpg"
      },
      {
        "id": "22",
        "name": "Next Generation Telecom Services",
        "role": "Freelance Consultant",
        "year": "1998",
        "outcome": "Provided consulting advice to a CTO of a telecom equipment provider",
        "summary": "Provided consulting advice to a telecom equipment provider to serve advanced services using a standard known as JAIN",
        "description": "Working as a consultant for the CTO of a small telecommunications company, built a proposal for a residential gateway based on the concepts of AIN and Javasoft’s Jini.  The proposal included high-level architectural recommendations that would permit the provisioning of enhanced services in a distributed network.",
        "industries": ["Telecommunications"],
        "skills": ["Java", "Telecommunications", "Protocols"],
        "products": ["JAIN", "AIN"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/telephony-switch.jpg"
      },
      {
        "id": "23",
        "name": "Wireless Services Infrastructure",
        "role": "Technical Lead",
        "year": "1997",
        "outcome": "Designed a wireless services advanced service to provide high speed dispatch and call monitoring",
        "summary": "Provided consulting advice to a telecom equipment provider to serve advanced services using a standard known as JAIN",
        "description": "Lead the development effort on a contract for a wireless service provider involving the development of software to manage their network.  The software provided the interface to the public switched telephone network through a Summa Four switch using standard CAS signaling.  It also provided the facilities for high-speed dispatch between handsets and standard telephony calls from handset to handset.  Balanced customer requirements with product design goals, resulting in an extremely flexible product capable of being used in many markets.  Lead the effort to convert the operations console from a Netview/6000 interface, to a web interface using some of the more common internet technologies available at the time:  HTML, CGI, and Java Applets.  The system was delivered on schedule, meeting the extremely rigid performance and network reliability requirements dictated by the customer.",
        "industries": ["Telecommunications"],
        "skills": ["HTML", "Web Development", "C/C++, Telecommunications"],
        "products": ["C/C++", "AIX"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/wirelesstower.jpg"
      },
      {
        "id": "24",
        "name": "Telecom Advanced Services",
        "role": "Technical Lead",
        "year": "1996",
        "outcome": "Technical Lead for advanced services platform for a telecom company such as conferencing, voice recognition, and advanced switching",
        "summary": "Lead the development of a platform for an advanced services system that augmented the telephone switching network to provide more advanced call services ",
        "description": "Technical project leader on a large systems integration contract for a regional telephone company to enhance the capabilities of their Intelligent Peripheral by adding advanced switching services, such as conferencing, multiple asynchronous out-dials, and call parking.  Gathered requirements from the RFP and translated them into design and development tasks during the early phases of the project.  Managed the development, system test, and packaging prior to delivery to the customer, and performed a comprehensive system test at the customer site over a period of nine months.  In a separate engagement, delivered a suite of test systems to test the new capabilities of the system under high call volume.  The system was accepted by the customer and is scheduled for deployment during 1998.",
        "industries": ["Telecommunications"],
        "skills": ["C/C++", "Telecommunications", "Voice Recognition", "Automated Testing"],
        "products": ["C/C++", "AIX"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/bellcentraloffice.jpg"
      },
      {
        "id": "25",
        "name": "Automated Telecom Testing Platform",
        "role": "Inventor and Technical Lead",
        "year": "1996",
        "outcome": "Automated testing of 100's of test to create a high quality system",
        "summary": "Invented and created an automated test platform using voice recognition and automation to verify the function of a calling card platfom",
        "description": "Delivered an automated test platform for a long distance company’s calling card platform.  Responsibilities included gathering requirements from the customer, designing the system, managing the development (2 contractors), deployment of the platform, and training end users.  The test platform consisted of a user interface to run test calls, as well as a development environment to create test scripts.  The test scripts were developed using a set of API’s which provide voice recognition to validate prompts and simulate a user pressing keys on the telephone keypad.  The system also validated the data in the calling card database which resided on an IBM mainframe running MVS.  The system was implemented using DirectTalk/6000, the HARK BBN Voice Recognition engine, and custom software written in C under AIX.",
        "industries": ["Telecommunications"],
        "skills": ["C/C++", "Telecommunications", "Voice Recognition", "Automated Testing"],
        "products": ["C/C++", "AIX"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/bellcentraloffice.jpg"
      },
      {
        "id": "26",
        "name": "Matrixed Switch Controller",
        "role": "Developer",
        "year": "1994",
        "outcome": "Developed Matrix Switch Controller",
        "summary": "Developed Matrix Switch Controller",
        "description": "Member of a small team tasked with designing and developing a matrix switch controller to be integrated as part of a long distance communication company’s services platform.  The matrix switch controller enhanced the platform by providing advanced switching services, such as conferencing, audio on hold, and multiple outdials.  The software was implemented on an RS/6000 under AIX using C and C++.  It communicated via TCP/IP to a Summa Four switch, and UDP/IP to the enhanced services platform.  The Summa Four connected to the public telephone network using ISDN Primary Rate with NFAS groups.  Designed and developed the statistics and call trace record portion of the switch controller.  Member of the integration team which tested the software at the customer site.",
        "industries": ["Telecommunications"],
        "skills": ["C/C++", "Telecommunications", "Network Programming"],
        "products": ["C/C++", "AIX", "TCP/IP"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/bellcentraloffice.jpg"
      },
      {
        "id": "28",
        "name": "Call Center Sales Application",
        "role": "Technical Consultant",
        "year": "1993",
        "outcome": "Assisted in the Development of an Insurance Application for Sales",
        "summary": "Provided OS/2 and programming experience to an insurance team building an insurance application for sales designed to capture and quote insurance",
        "description": "Provided C programming expertise under OS/2 to a development team working on an enhancement to an automobile insurance, telephone sales application. The enhancement allowed counselors to provide rate quotes over the phone, and optionally sell and bind the policy.  In addition to assisting members of the development team with programming and problem resolution.  Designed and developed a utility to change and examine application data at run-time through an intuitive GUI.  Additionally, developers could dump and load entire sets of data through a powerful scripting facility, allowing for complete test conditions to be saved and shared among the development team.  The utility proved to be extremely effective in the areas of debugging, unit/system testing, and regression testing.Developed a majority of the application code which retrieved data from a DB2/2 remote database.  The code was written in C and SQL.  Designed and developed a source control utility which allowed developers to check out, check in, and integrate components of code.  REXX procedures access a DLL written in C to provide file locking and unlocking using OS/2's extended attributes",
        "industries": ["Financial Services", "Insurance"],
        "skills": ["C/C++", "SQL", "REXX"],
        "products": ["C/C++", "DB2", "OS/2"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/callcentersales.jpg"
      },
      {
        "id": "29",
        "name": "Call Center Sales Application",
        "role": "Technical Consultant",
        "year": "1993",
        "outcome": "Assisted in the Development of an Insurance Application for Sales",
        "summary": "Provided OS/2 and programming experience to an insurance team building an insurance application for sales designed to capture and quote insurance",
        "description": "Developed an enhancement to an automobile-insurance, telephone-sales application by providing the ability for supervisors to approve requests for insurance on behalf of the customer service  representatives.  Using GUI data collection screens, customer service representatives gathered information from the customer and pass all information electronically to the supervisor at a separate workstation.  The supervisor reviewed the information, approved or rejected the application, and electronically passed the decision back to the counselor.  Running under IBM's OS/2 and Andersen's FCP Architecture, the application used a peer-peer approach to pass data between the two workstations.  The application was written in C using IBM's Database Manager and NetBIOS application programming interfaces.",
        "industries": ["Financial Services", "Insurance"],
        "skills": ["C/C++", "SQL", "REXX"],
        "products": ["C/C++", "DB2", "OS/2"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/callcentersales.jpg"
      },
      {
        "id": "30",
        "name": "Student Record Application",
        "role": "Freelance Consultant",
        "year": "1987",
        "outcome": "Created a student record system for a Law School",
        "summary": "Created a student record system for a law school to allow student record administration",
        "description": "Designed and developed a student record system for a law school.  The system assisted administrators in preparing rosters, transcripts, and custom reports through a user-friendly interface.  The system also featured a partial 'query by example' facility, which allowed powerful custom reporting.  The system was implemented using Clipper (an X-Base-type language) with relational database techniques",
        "industries": ["Software", "Education"],
        "skills": ["Foxbase", "SQL"],
        "products": ["Foxbase", "SQL", "4GL"],
        "url": "http://www.google.com",
        "urldescription": "A search engine",
        "image": "/projects/records.jpg"
      }
  ]
}